<?php

use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;

class PermissionTableSeeder extends Seeder
{

    public function run()
    {
        $permissions = [
            'لوحة-التحكم',
            'انظمة-الاشتراك',
            'تعديل-نظام-الاشتراك',
            'تشغيل-نظام-الاشتراك',
            'كل-الجلسات',
            'تحضير-جلسة',
            'كل-المشتركين',
            'اضافة-مشترك',
            'تعديل-مشترك',
            'حذف-مشترك',
            'كل-الوظائف',
            'اضافة-وظيفة',
            'تعديل-وظيفة',
            'حذف-وظيفة',
            'كل-الموظفين',
            'اضافة-موظف',
            'تعديل-موظف',
            'حذف-موظف',
            'كل-التمارين',
            'اضافة-تمرين',
            'اضافة-موعد-تمرين',
            'تعديل-تمرين',
            'حذف-تمرين',
            'كل-المدربين',
            'اضافة-متدرب',
            'تعديل-متدرب',
            'حذف-متدرب',
            'الحضور-والانصراف',
            'المستخدمين',
            'اضافة-مستخدم',
            'تعديل-مستخدم',
            'حذف-مستخدم',
            'الصلاحيات',
            'اضافة-صلاحية',
            'تعديل-صلاحية',
            'حذف-صلاحية',
         ];
      
         foreach ($permissions as $permission) {
              Permission::create(['name' => $permission]);
         }
    }
}
